app/views/events/index.html.erb

SELECT "events".* FROM "events" WHERE (datetime > '2020-11-26 19:30:11.917946')
---
<div class=" row">
  <% Event.datetimepast.each do |event| %>

SELECT "events".* FROM "events" WHERE (datetime > '2020-11-24 21:26:13.333157')
---
<div class=" row">
  <% Event.datetimefuture.each do |event| %>