app/views/events/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <p class="card-text">
       <small>-by <%= @event.user.first_name %> </small>