app/controllers/events_controller.rb

  def index
    @events = Event.all
---
SELECT "events".* FROM "events" WHERE "events"."datetime <= ?" = ? LIMIT ?  [["datetime <= ?", "2020-11-24 20:38:48.402724"], ["LIMIT", 1]]

  def create
    @event = current_user.created_events.build(event_params)

    if @event.save
---
INSERT INTO "events" ("datetime", "created_at", "updated_at", "creator", "description") VALUES (?, ?, ?, ?, ?)  [["datetime", "2020-11-30"], ["created_at", "2020-11-24 19:59:27.517822"], ["updated_at", "2020-11-24 19:59:27.517822"], ["creator", 1], ["description", "Puttings date in the form"]]

  def show
    if Event.find_by(id: params[:id].to_i).nil?
      redirect_to events_path
    else
      @event = Event.find(params[:id].to_i)
      @user = User.find(@event.creator)
      @attendees_id = @event.attendees.all
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 42], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]