app/controllers/event_users_controller.rb

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 34], ["LIMIT", 1]]
SELECT "event_users".* FROM "event_users" WHERE "event_users"."event_id" = ?  [["event_id", 1]]
INSERT INTO "event_users" ("event_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["event_id", 2], ["user_id", 34], ["created_at", "2020-11-24 17:30:25.580997"], ["updated_at", "2020-11-24 17:30:25.580997"]]
SELECT "event_users".* FROM "event_users" WHERE "event_users"."event_id" = ?  [["event_id", 2]]
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def create
    @event = Event.find_by(id: params[:format].to_i)
    @eventuser = EventUser.new(event_id:@event.id, user_id: current_user.id)

    @event.attendees.each do |user|
      if current_user.id == user.user_id
        redirect_to event_path(@event), alert: "You are already assisting this event!" and return
      end
    end

    if @eventuser.save
      flash[:notice] = "#{current_user.first_name} is assisting #{@event.description}!"