app/controllers/sessions_controller.rb

  def create
    @user = User.find_by(id: (params[:session][:number_field]).to_i)

    if @user.nil?
      @user = User.find_by(first_name: (params[:session][:first_name]).downcase)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."first_name" = ? LIMIT ?  [["first_name", "john"], ["LIMIT", 1]]