app/controllers/users_controller.rb

	def show
		@user = User.find(params[:format].to_i)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]