app/controllers/users_controller.rb

INSERT INTO "users" ("email", "first_name", "last_name", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["email", ""], ["first_name", "JOseph"], ["last_name", ""], ["password", ""], ["created_at", "2020-11-25 17:20:42.735764"], ["updated_at", "2020-11-25 17:20:42.735764"]]
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def set_user
    if logged_in?
      @user = User.find(session[:user_id])