app/models/event_user.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def search_user(user_id)
    User.find_by(id: user_id)

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def search_event(event_id)
    Event.find_by(id: event_id)